---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductInstallType
source: html/a20cabff-cb31-cb1f-7332-8c218385c839.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductInstallType Property

The product install type of the fabrication part.

## Syntax (C#)
```csharp
public string ProductInstallType { get; }
```